app/controllers/api/v1/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
            def index
              airlines = Airline.all

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" IS NULL LIMIT ?  [["LIMIT", 1]]
---
            def show
               airline = Airline.find_by(slug: params[:slug])